In [1]:
#data wrangling
import pandas as pd
import numpy as np
#datetime
import datetime as dt
pd.options.mode.chained_assignment = None  # default='warn'

In [2]:
# load sheet Transactions trong file KPMG và in ra 5 dòng đầu tiên
df= pd.read_excel('KPMG.xlsx', sheet_name= 'Transactions')

In [3]:
# in ra info bảng
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [4]:
# describe default
df.describe()

       transaction_id   product_id  ...  standard_cost  product_first_sold_date
count    20000.000000  20000.00000  ...   19803.000000             19803.000000
mean     10000.500000     45.36465  ...     556.046951             38199.776549
std       5773.647028     30.75359  ...     405.955660              2875.201110
min          1.000000      0.00000  ...       7.210000             33259.000000
25%       5000.750000     18.00000  ...     215.140000             35667.000000
50%      10000.500000     44.00000  ...     507.580000             38216.000000
75%      15000.250000     72.00000  ...     795.100000             40672.000000
max      20000.000000    100.00000  ...    1759.850000             42710.000000

[8 rows x 7 columns]

In [5]:
# describe các biến object
df.describe(include= 'object')

       order_status  brand product_line product_class product_size
count         20000  19803        19803         19803        19803
unique            2      6            4             3            3
top        Approved  Solex     Standard        medium       medium
freq          19821   4253        14176         13826        12990

In [6]:
# describe all
df.describe(include= 'all')

C:\Users\Admin\AppData\Local\Temp\ipykernel_16468\223697382.py:2: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.describe(include= 'all')

        transaction_id   product_id  ...  standard_cost product_first_sold_date
count     20000.000000  20000.00000  ...   19803.000000            19803.000000
unique             NaN          NaN  ...            NaN                     NaN
top                NaN          NaN  ...            NaN                     NaN
freq               NaN          NaN  ...            NaN                     NaN
first              NaN          NaN  ...            NaN                     NaN
last               NaN          NaN  ...            NaN                     NaN
mean      10000.500000     45.36465  ...     556.046951            38199.776549
std        5773.647028     30.75359  ...     405.955660             2875.201110
min           1.000000      0.00000  ...       7.210000            33259.000000
25%        5000.750000     18.00000  ...     215.140000            35667.000000
50%       10000.500000     44.00000  ...     507.580000            38216.000000
75%       15000.250000     72.00000  ...     795.100000            40672.000000
max       20000.000000    100.00000  ...    1759.850000            42710.000000

[13 rows x 13 columns]

In [7]:
# count số dòng bị null ở mỗi cột
df.isna().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

# 1. Data Correction

## 1.1 Drop NA

In [8]:
# tạo bảng df_dropna_all bằng cách loại bỏ tất cả giá trị null trong bảng và in ra info
df_dropna_all = df.dropna()

In [9]:
# tạo bảng df_dropna_online_order bằng cách loại bỏ giá trị null trong cột online_order và in ra info
df_dropna_online_order = df.dropna(subset= 'online_order')

## 1.2 Fill NA

In [10]:
# fill tất cả NA bằng 0, lưu vào bảng df_fillna_0 và in ra info
df_fillna_0 = df.fillna(0)
df_fillna_0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             20000 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    20000 non-null  object
 7   product_line             20000 non-null  object
 8   product_class            20000 non-null  object
 9   product_size             20000 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            20000 non-null  float64
 12  product_first_sold_date  20000 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [11]:
# fill NA bằng ffill, lưu vào bảng df_fillna_ffill và in ra info
df_fillna_ffill = df.fillna(method= 'ffill')
df_fillna_ffill.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             20000 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    20000 non-null  object
 7   product_line             20000 non-null  object
 8   product_class            20000 non-null  object
 9   product_size             20000 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            20000 non-null  float64
 12  product_first_sold_date  20000 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [12]:
# fill NA bằng bfill, lưu vào bảng df_fillna_bfill và in ra info
df_fillna_ffill = df.fillna(method= 'bfill')
df_fillna_ffill.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             20000 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    20000 non-null  object
 7   product_line             20000 non-null  object
 8   product_class            20000 non-null  object
 9   product_size             20000 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            20000 non-null  float64
 12  product_first_sold_date  20000 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

## 1.3. Assess Categorical Data

In [13]:
# load sheet Demographic và hiển thị 5 dòng đầu tiên
dem= pd.read_excel('KPMG.xlsx', sheet_name= 'CustomerDemographic')

C:\Users\Admin\AppData\Local\Temp\ipykernel_16468\731607591.py:2: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  dem= pd.read_excel('KPMG.xlsx', sheet_name= 'CustomerDemographic')

In [14]:
# in ra info bảng
dem.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [15]:
# describe các giá trị object
dem.describe(include= 'object')

       first_name last_name  gender  ... deceased_indicator default owns_car
count        4000      3875    4000  ...               4000    3698     4000
unique       3139      3725       6  ...                  2      90        2
top           Max  Pristnor  Female  ...                  N     100      Yes
freq            5         3    2037  ...               3998     113     2024

[4 rows x 9 columns]

In [16]:
# Remove all NA rows, then use output for the following steps
dem = dem.dropna()

In [17]:
# In ra các giá trị unique của cột gender
dem.gender.unique()

array(['F', 'Male', 'Female', 'Femal'], dtype=object)

In [18]:
# Quy chuẩn cột gender về các nhóm Male, Female, Unisex và in ra giá trị unique mới
dem.gender.replace(['F', 'Femal'], 'Female', inplace= True)
dem.gender.unique()

array(['Female', 'Male'], dtype=object)

In [19]:
# Tính tuổi của mỗi khách hàng, lưu vào cột "age" và in ra min age, max age
dem['age'] = pd.to_datetime('today').year - dem.DOB.dt.year
print(
    'Min age: {}'.format(dem['age'].min())
)
print(
    'Msx age: {}'.format(dem['age'].max())
)

Min age: 20
Msx age: 91

In [20]:
# phân nhóm khách hàng dưới 35 tuổi là nhóm "Young", Từ 35 - 55 là "Middle", trên 55 là "Older"
# lưu vào cột "age_group" bằng cách sử dụng hàm cut
pd.cut(
    dem.age,
    [19,34,55,92],
    labels= ['Young', 'Middle', 'Older']
)

0        Older
1       Middle
2        Older
8       Middle
9        Young
         ...
3992    Middle
3993     Young
3994    Middle
3995    Middle
3996     Young
Name: age, Length: 2630, dtype: category
Categories (3, object): ['Young' < 'Middle' < 'Older']

# 2. Data Completeness

In [33]:
#join bảng transactions vs demographic (đều đã dropna) và in ra những giao dịch thiếu thông tin demographic (last name hoặc first name)
trans_dem_left = df_dropna_all.merge(dem, how='left', on='customer_id')

print(trans_dem[ (trans_dem.first_name.isna()) | (trans_dem.last_name.isna()) ])

       transaction_id  product_id  customer_id  ... owns_car  tenure age
4                   5          78          787  ...      NaN     NaN NaN
7                   8          15         2459  ...      NaN     NaN NaN
10                 11           5         1986  ...      NaN     NaN NaN
16                 17          79         2426  ...      NaN     NaN NaN
24                 25          89         2822  ...      NaN     NaN NaN
...               ...         ...          ...  ...      ...     ...  ..
19433           19989           0          714  ...      NaN     NaN NaN
19436           19992          11         1374  ...      NaN     NaN NaN
19437           19993          13            5  ...      NaN     NaN NaN
19438           19994          77         2618  ...      NaN     NaN NaN
19443           19999           6         2764  ...      NaN     NaN NaN

[6463 rows x 26 columns]

In [34]:
#Inner join 2 bảng:
trans_dem = df_dropna_all.merge(dem, on='customer_id')

# 3. Data Aggregation (after dropping null values)

In [35]:
# tính tổng khách hàng có phát sinh giao dịch bằng hàm nunique
trans_dem.customer_id.nunique()

2329

In [42]:
# Tính số khách hàng mỗi tháng

trans_dem['year_month'] = trans_dem.transaction_date.dt.strftime("%Y-%m")
trans_dem.groupby('year_month').customer_id.nunique()

year_month
2017-01    878
2017-02    859
2017-03    848
2017-04    876
2017-05    871
2017-06    826
2017-07    868
2017-08    888
2017-09    826
2017-10    886
2017-11    869
2017-12    877
Name: customer_id, dtype: int64

In [43]:
# Tính gross margin của mỗi tháng. gross_margin = list_price - standard_cost
# hint 1: tạo column gross_margin
# hint 2: group by year_month và sử dụng hàm agg

trans_dem['gross_margin'] = trans_dem.list_price - trans_dem.standard_cost
trans_dem.groupby('year_month').gross_margin.agg('sum')

year_month
2017-01    598361.59
2017-02    585956.49
2017-03    583459.93
2017-04    614345.11
2017-05    612053.28
2017-06    557927.11
2017-07    602030.44
2017-08    629727.79
2017-09    557052.49
2017-10    633585.93
2017-11    611242.54
2017-12    581086.57
Name: gross_margin, dtype: float64

In [47]:
# Tính số lượng order và doanh thu group by online_order và order_status 
# hint 1: group by online_order, order_status và sử dụng hàm agg

trans_dem.groupby(['online_order', 'order_status']).agg({'transaction_id': 'count', 'list_price': 'sum'})

                           transaction_id  list_price
online_order order_status
0.0          Approved                6456  7177595.84
             Cancelled                 51    61234.06
1.0          Approved                6399  7073731.30
             Cancelled                 76    85719.15

# 4. Data Visualization